MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26J53/mcu.h
extern volatile PMDIS3bits_t PMDIS3bits __at(0xEBC);
// bitfield macros
#define _PMDIS3_CCP4MD_POSN                                 0x1
#define _PMDIS3_CCP4MD_POSITION                             0x1
#define _PMDIS3_CCP4MD_SIZE                                 0x1
#define _PMDIS3_CCP4MD_LENGTH                               0x1
#define _PMDIS3_CCP4MD_MASK                                 0x2
#define _PMDIS3_CCP5MD_POSN                                 0x2
#define _PMDIS3_CCP5MD_POSITION                             0x2
#define _PMDIS3_CCP5MD_SIZE                                 0x1
#define _PMDIS3_CCP5MD_LENGTH                               0x1
#define _PMDIS3_CCP5MD_MASK                                 0x4
#define _PMDIS3_CCP6MD_POSN                                 0x3
#define _PMDIS3_CCP6MD_POSITION                             0x3
#define _PMDIS3_CCP6MD_SIZE                                 0x1
#define _PMDIS3_CCP6MD_LENGTH                               0x1
#define _PMDIS3_CCP6MD_MASK                                 0x8
#define _PMDIS3_CCP7MD_POSN                                 0x4
#define _PMDIS3_CCP7MD_POSITION                             0x4
#define _PMDIS3_CCP7MD_SIZE                                 0x1
#define _PMDIS3_CCP7MD_LENGTH                               0x1
#define _PMDIS3_CCP7MD_MASK                                 0x10
#define _PMDIS3_CCP8MD_POSN                                 0x5
#define _PMDIS3_CCP8MD_POSITION                             0x5
#define _PMDIS3_CCP8MD_SIZE                                 0x1
#define _PMDIS3_CCP8MD_LENGTH                               0x1
#define _PMDIS3_CCP8MD_MASK                                 0x20
#define _PMDIS3_CCP9MD_POSN                                 0x6
#define _PMDIS3_CCP9MD_POSITION                             0x6
#define _PMDIS3_CCP9MD_SIZE                                 0x1
#define _PMDIS3_CCP9MD_LENGTH                               0x1
#define _PMDIS3_CCP9MD_MASK                                 0x40
#define _PMDIS3_CCP10MD_POSN                                0x7
#define _PMDIS3_CCP10MD_POSITION                            0x7
#define _PMDIS3_CCP10MD_SIZE                                0x1
#define _PMDIS3_CCP10MD_LENGTH                              0x1
#define _PMDIS3_CCP10MD_MASK                                0x80
#define _PMDIS3_PMDCCP4_POSN                                0x1
#define _PMDIS3_PMDCCP4_POSITION                            0x1
#define _PMDIS3_PMDCCP4_SIZE                                0x1
#define _PMDIS3_PMDCCP4_LENGTH                              0x1
#define _PMDIS3_PMDCCP4_MASK                                0x2
#define _PMDIS3_PMDCCP5_POSN                                0x2
#define _PMDIS3_PMDCCP5_POSITION                            0x2
#define _PMDIS3_PMDCCP5_SIZE                                0x1
#define _PMDIS3_PMDCCP5_LENGTH                              0x1
#define _PMDIS3_PMDCCP5_MASK                                0x4
#define _PMDIS3_PMDCCP6_POSN                                0x3
#define _PMDIS3_PMDCCP6_POSITION                            0x3
#define _PMDIS3_PMDCCP6_SIZE                                0x1
#define _PMDIS3_PMDCCP6_LENGTH                              0x1
#define _PMDIS3_PMDCCP6_MASK                                0x8
#define _PMDIS3_PMDCCP7_POSN                                0x4
#define _PMDIS3_PMDCCP7_POSITION                            0x4
#define _PMDIS3_PMDCCP7_SIZE                                0x1
#define _PMDIS3_PMDCCP7_LENGTH                              0x1
#define _PMDIS3_PMDCCP7_MASK                                0x10
#define _PMDIS3_PMDCCP8_POSN                                0x5
#define _PMDIS3_PMDCCP8_POSITION                            0x5
#define _PMDIS3_PMDCCP8_SIZE                                0x1
#define _PMDIS3_PMDCCP8_LENGTH                              0x1
#define _PMDIS3_PMDCCP8_MASK                                0x20
#define _PMDIS3_PMDCCP9_POSN                                0x6
#define _PMDIS3_PMDCCP9_POSITION                            0x6
#define _PMDIS3_PMDCCP9_SIZE                                0x1
#define _PMDIS3_PMDCCP9_LENGTH                              0x1
#define _PMDIS3_PMDCCP9_MASK                                0x40
#define _PMDIS3_PMDCCP10_POSN                               0x7
#define _PMDIS3_PMDCCP10_POSITION                           0x7
#define _PMDIS3_PMDCCP10_SIZE                               0x1
#define _PMDIS3_PMDCCP10_LENGTH                             0x1
#define _PMDIS3_PMDCCP10_MASK                               0x80
#define _PMDIS3_PMDCCP_POSN                                 0x1
#define _PMDIS3_PMDCCP_POSITION                             0x1
#define _PMDIS3_PMDCCP_SIZE                                 0x7
#define _PMDIS3_PMDCCP_LENGTH                               0x7
#define _PMDIS3_PMDCCP_MASK                                 0xFE
#define _PMDIS3_CCPMD_POSN                                  0x1
#define _PMDIS3_CCPMD_POSITION                              0x1
#define _PMDIS3_CCPMD_SIZE                                  0x7
#define _PMDIS3_CCPMD_LENGTH                                0x7
#define _PMDIS3_CCPMD_MASK                                  0xFE
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CCP4MD                 :1;
        unsigned CCP5MD                 :1;
        unsigned CCP6MD                 :1;
        unsigned CCP7MD                 :1;
        unsigned CCP8MD                 :1;
        unsigned CCP9MD                 :1;
        unsigned CCP10MD                :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDCCP4                :1;
        unsigned PMDCCP5                :1;
        unsigned PMDCCP6                :1;
        unsigned PMDCCP7                :1;
        unsigned PMDCCP8                :1;
        unsigned PMDCCP9                :1;
        unsigned PMDCCP10               :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDCCP                 :7;
    };
    struct {
        unsigned                        :1;
        unsigned CCPMD                  :7;
    };
} PD3bits_t;
extern volatile PD3bits_t PD3bits __at(0xEBC);
// bitfield macros
#define _PD3_CCP4MD_POSN                                    0x1
#define _PD3_CCP4MD_POSITION                                0x1
#define _PD3_CCP4MD_SIZE                                    0x1
#define _PD3_CCP4MD_LENGTH                                  0x1
#define _PD3_CCP4MD_MASK                                    0x2
#define _PD3_CCP5MD_POSN                                    0x2
#define _PD3_CCP5MD_POSITION                                0x2
#define _PD3_CCP5MD_SIZE                                    0x1
#define _PD3_CCP5MD_LENGTH                                  0x1
#define _PD3_CCP5MD_MASK                                    0x4
#define _PD3_CCP6MD_POSN                                    0x3
#define _PD3_CCP6MD_POSITION                                0x3
#define _PD3_CCP6MD_SIZE                                    0x1
#define _PD3_CCP6MD_LENGTH                                  0x1
#define _PD3_CCP6MD_MASK                                    0x8
#define _PD3_CCP7MD_POSN                                    0x4
#define _PD3_CCP7MD_POSITION                                0x4
#define _PD3_CCP7MD_SIZE                                    0x1
#define _PD3_CCP7MD_LENGTH                                  0x1
#define _PD3_CCP7MD_MASK                                    0x10
#define _PD3_CCP8MD_POSN                                    0x5
#define _PD3_CCP8MD_POSITION                                0x5
#define _PD3_CCP8MD_SIZE                                    0x1
#define _PD3_CCP8MD_LENGTH                                  0x1
#define _PD3_CCP8MD_MASK                                    0x20
#define _PD3_CCP9MD_POSN                                    0x6
#define _PD3_CCP9MD_POSITION                                0x6
#define _PD3_CCP9MD_SIZE                                    0x1
#define _PD3_CCP9MD_LENGTH                                  0x1
#define _PD3_CCP9MD_MASK                                    0x40
#define _PD3_CCP10MD_POSN                                   0x7
#define _PD3_CCP10MD_POSITION                               0x7
#define _PD3_CCP10MD_SIZE                                   0x1
#define _PD3_CCP10MD_LENGTH                                 0x1
#define _PD3_CCP10MD_MASK                                   0x80
#define _PD3_PMDCCP4_POSN                                   0x1
#define _PD3_PMDCCP4_POSITION                               0x1
#define _PD3_PMDCCP4_SIZE                                   0x1
#define _PD3_PMDCCP4_LENGTH                                 0x1
#define _PD3_PMDCCP4_MASK                                   0x2
#define _PD3_PMDCCP5_POSN                                   0x2
#define _PD3_PMDCCP5_POSITION                               0x2
#define _PD3_PMDCCP5_SIZE                                   0x1
#define _PD3_PMDCCP5_LENGTH                                 0x1
#define _PD3_PMDCCP5_MASK                                   0x4
#define _PD3_PMDCCP6_POSN                                   0x3
#define _PD3_PMDCCP6_POSITION                               0x3
#define _PD3_PMDCCP6_SIZE                                   0x1
#define _PD3_PMDCCP6_LENGTH                                 0x1
#define _PD3_PMDCCP6_MASK                                   0x8
#define _PD3_PMDCCP7_POSN                                   0x4
#define _PD3_PMDCCP7_POSITION                               0x4
#define _PD3_PMDCCP7_SIZE                                   0x1
#define _PD3_PMDCCP7_LENGTH                                 0x1
#define _PD3_PMDCCP7_MASK                                   0x10
#define _PD3_PMDCCP8_POSN                                   0x5
#define _PD3_PMDCCP8_POSITION                               0x5
#define _PD3_PMDCCP8_SIZE                                   0x1
#define _PD3_PMDCCP8_LENGTH                                 0x1
#define _PD3_PMDCCP8_MASK                                   0x20
#define _PD3_PMDCCP9_POSN                                   0x6
#define _PD3_PMDCCP9_POSITION                               0x6
#define _PD3_PMDCCP9_SIZE                                   0x1
#define _PD3_PMDCCP9_LENGTH                                 0x1
#define _PD3_PMDCCP9_MASK                                   0x40
#define _PD3_PMDCCP10_POSN                                  0x7
#define _PD3_PMDCCP10_POSITION                              0x7
#define _PD3_PMDCCP10_SIZE                                  0x1
#define _PD3_PMDCCP10_LENGTH                                0x1
#define _PD3_PMDCCP10_MASK                                  0x80
#define _PD3_PMDCCP_POSN                                    0x1
#define _PD3_PMDCCP_POSITION                                0x1
#define _PD3_PMDCCP_SIZE                                    0x7
#define _PD3_PMDCCP_LENGTH                                  0x7
#define _PD3_PMDCCP_MASK                                    0xFE
#define _PD3_CCPMD_POSN                                     0x1
#define _PD3_CCPMD_POSITION                                 0x1
#define _PD3_CCPMD_SIZE                                     0x7
#define _PD3_CCPMD_LENGTH                                   0x7
#define _PD3_CCPMD_MASK                                     0xFE

