MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26J53/mcu.h
extern volatile __bit                   C4TSEL0             __at(0x7A88);	// @ (0xF51 * 8 + 0)
#define                                 C4TSEL0_bit         _BIT_ACCESS(CCPTMRS1,0)
// CCPTMRS1<C4TSEL1>
extern volatile __bit                   C4TSEL1             __at(0x7A89);	// @ (0xF51 * 8 + 1)
#define                                 C4TSEL1_bit         _BIT_ACCESS(CCPTMRS1,1)
// CCPTMRS1<C5TSEL0>
extern volatile __bit                   C5TSEL0             __at(0x7A8A);	// @ (0xF51 * 8 + 2)
#define                                 C5TSEL0_bit         _BIT_ACCESS(CCPTMRS1,2)
// CCPTMRS1<C6TSEL0>
extern volatile __bit                   C6TSEL0             __at(0x7A8C);	// @ (0xF51 * 8 + 4)
#define                                 C6TSEL0_bit         _BIT_ACCESS(CCPTMRS1,4)
// CCPTMRS1<C7TSEL0>
extern volatile __bit                   C7TSEL0             __at(0x7A8E);	// @ (0xF51 * 8 + 6)
#define                                 C7TSEL0_bit         _BIT_ACCESS(CCPTMRS1,6)
// CCPTMRS1<C7TSEL1>
extern volatile __bit                   C7TSEL1             __at(0x7A8F);	// @ (0xF51 * 8 + 7)
#define                                 C7TSEL1_bit         _BIT_ACCESS(CCPTMRS1,7)
// CCPTMRS2<C8TSEL0>
extern volatile __bit                   C8TSEL0             __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 C8TSEL0_bit         _BIT_ACCESS(CCPTMRS2,0)
// CCPTMRS2<C8TSEL1>
extern volatile __bit                   C8TSEL1             __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 C8TSEL1_bit         _BIT_ACCESS(CCPTMRS2,1)
// CCPTMRS2<C9TSEL0>
extern volatile __bit                   C9TSEL0             __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 C9TSEL0_bit         _BIT_ACCESS(CCPTMRS2,2)
// RTCCAL<CAL0>
extern volatile __bit                   CAL0                __at(0x79F0);	// @ (0xF3E * 8 + 0)
#define                                 CAL0_bit            _BIT_ACCESS(RTCCAL,0)
// RTCCAL<CAL1>
extern volatile __bit                   CAL1                __at(0x79F1);	// @ (0xF3E * 8 + 1)
#define                                 CAL1_bit            _BIT_ACCESS(RTCCAL,1)
// RTCCAL<CAL2>
extern volatile __bit                   CAL2                __at(0x79F2);	// @ (0xF3E * 8 + 2)
#define                                 CAL2_bit            _BIT_ACCESS(RTCCAL,2)
// RTCCAL<CAL3>
extern volatile __bit                   CAL3                __at(0x79F3);	// @ (0xF3E * 8 + 3)
#define                                 CAL3_bit            _BIT_ACCESS(RTCCAL,3)
// RTCCAL<CAL4>
extern volatile __bit                   CAL4                __at(0x79F4);	// @ (0xF3E * 8 + 4)
#define                                 CAL4_bit            _BIT_ACCESS(RTCCAL,4)
// RTCCAL<CAL5>
extern volatile __bit                   CAL5                __at(0x79F5);	// @ (0xF3E * 8 + 5)
#define                                 CAL5_bit            _BIT_ACCESS(RTCCAL,5)
// RTCCAL<CAL6>
extern volatile __bit                   CAL6                __at(0x79F6);	// @ (0xF3E * 8 + 6)
#define                                 CAL6_bit            _BIT_ACCESS(RTCCAL,6)
// RTCCAL<CAL7>
extern volatile __bit                   CAL7                __at(0x79F7);	// @ (0xF3E * 8 + 7)
#define                                 CAL7_bit            _BIT_ACCESS(RTCCAL,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CM1CON<CCH01>
extern volatile __bit                   CCH01               __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 CCH01_bit           _BIT_ACCESS(CM1CON,0)
// CM2CON<CCH02>
extern volatile __bit                   CCH02               __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 CCH02_bit           _BIT_ACCESS(CM2CON,0)
// CM3CON<CCH03>
extern volatile __bit                   CCH03               __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 CCH03_bit           _BIT_ACCESS(CM3CON,0)
// IPR5<CCH05>
extern volatile __bit                   CCH05               __at(0x7CC8);	// @ (0xF99 * 8 + 0)
#define                                 CCH05_bit           _BIT_ACCESS(IPR5,0)
// CM1CON<CCH11>
extern volatile __bit                   CCH11               __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 CCH11_bit           _BIT_ACCESS(CM1CON,1)
// CM2CON<CCH12>
extern volatile __bit                   CCH12               __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 CCH12_bit           _BIT_ACCESS(CM2CON,1)
// CM3CON<CCH13>
extern volatile __bit                   CCH13               __at(0x7929);	// @ (0xF25 * 8 + 1)
#define                                 CCH13_bit           _BIT_ACCESS(CM3CON,1)
// IPR5<CCH15>
extern volatile __bit                   CCH15               __at(0x7CC9);	// @ (0xF99 * 8 + 1)
#define                                 CCH15_bit           _BIT_ACCESS(IPR5,1)
// IPR4<CCIP3IP>
extern volatile __bit                   CCIP3IP             __at(0x7C80);	// @ (0xF90 * 8 + 0)
#define                                 CCIP3IP_bit         _BIT_ACCESS(IPR4,0)
// PORTC<CCP10>
extern volatile __bit                   CCP10               __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 CCP10_bit           _BIT_ACCESS(PORTC,7)
// PIE4<CCP10IE>
extern volatile __bit                   CCP10IE             __at(0x7C77);	// @ (0xF8E * 8 + 7)
#define                                 CCP10IE_bit         _BIT_ACCESS(PIE4,7)
// PIR4<CCP10IF>
extern volatile __bit                   CCP10IF             __at(0x7C7F);	// @ (0xF8F * 8 + 7)
#define                                 CCP10IF_bit         _BIT_ACCESS(PIR4,7)
// IPR4<CCP10IP>
extern volatile __bit                   CCP10IP             __at(0x7C87);	// @ (0xF90 * 8 + 7)
#define                                 CCP10IP_bit         _BIT_ACCESS(IPR4,7)
// CCP10CON<CCP10M0>
extern volatile __bit                   CCP10M0             __at(0x7800);	// @ (0xF00 * 8 + 0)
#define                                 CCP10M0_bit         _BIT_ACCESS(CCP10CON,0)
// CCP10CON<CCP10M1>
extern volatile __bit                   CCP10M1             __at(0x7801);	// @ (0xF00 * 8 + 1)
#define                                 CCP10M1_bit         _BIT_ACCESS(CCP10CON,1)
// CCP10CON<CCP10M2>
extern volatile __bit                   CCP10M2             __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 CCP10M2_bit         _BIT_ACCESS(CCP10CON,2)
// CCP10CON<CCP10M3>
extern volatile __bit                   CCP10M3             __at(0x7803);	// @ (0xF00 * 8 + 3)
#define                                 CCP10M3_bit         _BIT_ACCESS(CCP10CON,3)
// PMDIS3<CCP10MD>
extern volatile __bit                   CCP10MD             __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 CCP10MD_bit         _BIT_ACCESS(PMDIS3,7)
// ODCON2<CCP10OD>
extern volatile __bit                   CCP10OD             __at(0x7A0B);	// @ (0xF41 * 8 + 3)
#define                                 CCP10OD_bit         _BIT_ACCESS(ODCON2,3)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7DA0);	// @ (0xFB4 * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7DA1);	// @ (0xFB4 * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7DA2);	// @ (0xFB4 * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7DA3);	// @ (0xFB4 * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PIE4<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x7C70);	// @ (0xF8E * 8 + 0)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x7C78);	// @ (0xF8F * 8 + 0)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x7C80);	// @ (0xF90 * 8 + 0)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR4,0)
// CCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x78AA);	// @ (0xF15 * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x78AB);	// @ (0xF15 * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(CCP3CON,3)
// PORTB<CCP4>
extern volatile __bit                   CCP4                __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 CCP4_bit            _BIT_ACCESS(PORTB,4)
// PIE4<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x7C71);	// @ (0xF8E * 8 + 1)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x7C79);	// @ (0xF8F * 8 + 1)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x7C81);	// @ (0xF90 * 8 + 1)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR4,1)
// CCP4CON<CCP4M0>
extern volatile __bit                   CCP4M0              __at(0x7890);	// @ (0xF12 * 8 + 0)
#define                                 CCP4M0_bit          _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4M1>
extern volatile __bit                   CCP4M1              __at(0x7891);	// @ (0xF12 * 8 + 1)
#define                                 CCP4M1_bit          _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4M2>
extern volatile __bit                   CCP4M2              __at(0x7892);	// @ (0xF12 * 8 + 2)
#define                                 CCP4M2_bit          _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4M3>
extern volatile __bit                   CCP4M3              __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 CCP4M3_bit          _BIT_ACCESS(CCP4CON,3)
// PMDIS3<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMDIS3,1)
// ODCON1<CCP4OD>
extern volatile __bit                   CCP4OD              __at(0x7A13);	// @ (0xF42 * 8 + 3)
#define                                 CCP4OD_bit          _BIT_ACCESS(ODCON1,3)
// PORTB<CCP5>
extern volatile __bit                   CCP5                __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 CCP5_bit            _BIT_ACCESS(PORTB,5)
// PIE4<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x7C72);	// @ (0xF8E * 8 + 2)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x7C7A);	// @ (0xF8F * 8 + 2)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR4,2)
// IPR4<CCP5IP>
extern volatile __bit                   CCP5IP              __at(0x7C82);	// @ (0xF90 * 8 + 2)
#define                                 CCP5IP_bit          _BIT_ACCESS(IPR4,2)
// CCP5CON<CCP5M0>
extern volatile __bit                   CCP5M0              __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 CCP5M0_bit          _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5M1>
extern volatile __bit                   CCP5M1              __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 CCP5M1_bit          _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5M2>
extern volatile __bit                   CCP5M2              __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 CCP5M2_bit          _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5M3>
extern volatile __bit                   CCP5M3              __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 CCP5M3_bit          _BIT_ACCESS(CCP5CON,3)
// PMDIS3<CCP5MD>
extern volatile __bit                   CCP5MD              __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 CCP5MD_bit          _BIT_ACCESS(PMDIS3,2)
// ODCON1<CCP5OD>
extern volatile __bit                   CCP5OD              __at(0x7A14);	// @ (0xF42 * 8 + 4)
#define                                 CCP5OD_bit          _BIT_ACCESS(ODCON1,4)
// PORTB<CCP6>
extern volatile __bit                   CCP6                __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 CCP6_bit            _BIT_ACCESS(PORTB,6)
// PIE4<CCP6IE>
extern volatile __bit                   CCP6IE              __at(0x7C73);	// @ (0xF8E * 8 + 3)
#define                                 CCP6IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<CCP6IF>
extern volatile __bit                   CCP6IF              __at(0x7C7B);	// @ (0xF8F * 8 + 3)
#define                                 CCP6IF_bit          _BIT_ACCESS(PIR4,3)
// IPR4<CCP6IP>
extern volatile __bit                   CCP6IP              __at(0x7C83);	// @ (0xF90 * 8 + 3)
#define                                 CCP6IP_bit          _BIT_ACCESS(IPR4,3)
// CCP6CON<CCP6M0>
extern volatile __bit                   CCP6M0              __at(0x7860);	// @ (0xF0C * 8 + 0)
#define                                 CCP6M0_bit          _BIT_ACCESS(CCP6CON,0)
// CCP6CON<CCP6M1>
extern volatile __bit                   CCP6M1              __at(0x7861);	// @ (0xF0C * 8 + 1)
#define                                 CCP6M1_bit          _BIT_ACCESS(CCP6CON,1)
// CCP6CON<CCP6M2>
extern volatile __bit                   CCP6M2              __at(0x7862);	// @ (0xF0C * 8 + 2)
#define                                 CCP6M2_bit          _BIT_ACCESS(CCP6CON,2)
// CCP6CON<CCP6M3>
extern volatile __bit                   CCP6M3              __at(0x7863);	// @ (0xF0C * 8 + 3)
#define                                 CCP6M3_bit          _BIT_ACCESS(CCP6CON,3)
// PMDIS3<CCP6MD>
extern volatile __bit                   CCP6MD              __at(0x75E3);	// @ (0xEBC * 8 + 3)
#define                                 CCP6MD_bit          _BIT_ACCESS(PMDIS3,3)
// ODCON1<CCP6OD>
extern volatile __bit                   CCP6OD              __at(0x7A15);	// @ (0xF42 * 8 + 5)
#define                                 CCP6OD_bit          _BIT_ACCESS(ODCON1,5)
// PORTB<CCP7>
extern volatile __bit                   CCP7                __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 CCP7_bit            _BIT_ACCESS(PORTB,7)
// PIE4<CCP7IE>
extern volatile __bit                   CCP7IE              __at(0x7C74);	// @ (0xF8E * 8 + 4)
#define                                 CCP7IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<CCP7IF>
extern volatile __bit                   CCP7IF              __at(0x7C7C);	// @ (0xF8F * 8 + 4)
#define                                 CCP7IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<CCP7IP>
extern volatile __bit                   CCP7IP              __at(0x7C84);	// @ (0xF90 * 8 + 4)
#define                                 CCP7IP_bit          _BIT_ACCESS(IPR4,4)
// CCP7CON<CCP7M0>
extern volatile __bit                   CCP7M0              __at(0x7848);	// @ (0xF09 * 8 + 0)
#define                                 CCP7M0_bit          _BIT_ACCESS(CCP7CON,0)
// CCP7CON<CCP7M1>
extern volatile __bit                   CCP7M1              __at(0x7849);	// @ (0xF09 * 8 + 1)
#define                                 CCP7M1_bit          _BIT_ACCESS(CCP7CON,1)
// CCP7CON<CCP7M2>
extern volatile __bit                   CCP7M2              __at(0x784A);	// @ (0xF09 * 8 + 2)
#define                                 CCP7M2_bit          _BIT_ACCESS(CCP7CON,2)
// CCP7CON<CCP7M3>
extern volatile __bit                   CCP7M3              __at(0x784B);	// @ (0xF09 * 8 + 3)
#define                                 CCP7M3_bit          _BIT_ACCESS(CCP7CON,3)
// PMDIS3<CCP7MD>
extern volatile __bit                   CCP7MD              __at(0x75E4);	// @ (0xEBC * 8 + 4)
#define                                 CCP7MD_bit          _BIT_ACCESS(PMDIS3,4)
// ODCON1<CCP7OD>
extern volatile __bit                   CCP7OD              __at(0x7A16);	// @ (0xF42 * 8 + 6)
#define                                 CCP7OD_bit          _BIT_ACCESS(ODCON1,6)
// PORTC<CCP8>
extern volatile __bit                   CCP8                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP8_bit            _BIT_ACCESS(PORTC,1)
// PIE4<CCP8IE>
extern volatile __bit                   CCP8IE              __at(0x7C75);	// @ (0xF8E * 8 + 5)
#define                                 CCP8IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<CCP8IF>
extern volatile __bit                   CCP8IF              __at(0x7C7D);	// @ (0xF8F * 8 + 5)
#define                                 CCP8IF_bit          _BIT_ACCESS(PIR4,5)
// IPR4<CCP8IP>
extern volatile __bit                   CCP8IP              __at(0x7C85);	// @ (0xF90 * 8 + 5)
#define                                 CCP8IP_bit          _BIT_ACCESS(IPR4,5)
// CCP8CON<CCP8M0>
extern volatile __bit                   CCP8M0              __at(0x7830);	// @ (0xF06 * 8 + 0)
#define                                 CCP8M0_bit          _BIT_ACCESS(CCP8CON,0)
// CCP8CON<CCP8M1>
extern volatile __bit                   CCP8M1              __at(0x7831);	// @ (0xF06 * 8 + 1)
#define                                 CCP8M1_bit          _BIT_ACCESS(CCP8CON,1)
// CCP8CON<CCP8M2>
extern volatile __bit                   CCP8M2              __at(0x7832);	// @ (0xF06 * 8 + 2)
#define                                 CCP8M2_bit          _BIT_ACCESS(CCP8CON,2)
// CCP8CON<CCP8M3>
extern volatile __bit                   CCP8M3              __at(0x7833);	// @ (0xF06 * 8 + 3)
#define                                 CCP8M3_bit          _BIT_ACCESS(CCP8CON,3)
// PMDIS3<CCP8MD>
extern volatile __bit                   CCP8MD              __at(0x75E5);	// @ (0xEBC * 8 + 5)
#define                                 CCP8MD_bit          _BIT_ACCESS(PMDIS3,5)
// ODCON1<CCP8OD>
extern volatile __bit                   CCP8OD              __at(0x7A17);	// @ (0xF42 * 8 + 7)
#define                                 CCP8OD_bit          _BIT_ACCESS(ODCON1,7)
// PORTC<CCP9>
extern volatile __bit                   CCP9                __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CCP9_bit            _BIT_ACCESS(PORTC,6)
// PIE4<CCP9IE>
extern volatile __bit                   CCP9IE              __at(0x7C76);	// @ (0xF8E * 8 + 6)
#define                                 CCP9IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<CCP9IF>
extern volatile __bit                   CCP9IF              __at(0x7C7E);	// @ (0xF8F * 8 + 6)
#define                                 CCP9IF_bit          _BIT_ACCESS(PIR4,6)
// IPR4<CCP9IP>
extern volatile __bit                   CCP9IP              __at(0x7C86);	// @ (0xF90 * 8 + 6)
#define                                 CCP9IP_bit          _BIT_ACCESS(IPR4,6)
// CCP9CON<CCP9M0>
extern volatile __bit                   CCP9M0              __at(0x7818);	// @ (0xF03 * 8 + 0)
#define                                 CCP9M0_bit          _BIT_ACCESS(CCP9CON,0)
// CCP9CON<CCP9M1>
extern volatile __bit                   CCP9M1              __at(0x7819);	// @ (0xF03 * 8 + 1)
#define                                 CCP9M1_bit          _BIT_ACCESS(CCP9CON,1)
// CCP9CON<CCP9M2>
extern volatile __bit                   CCP9M2              __at(0x781A);	// @ (0xF03 * 8 + 2)
#define                                 CCP9M2_bit          _BIT_ACCESS(CCP9CON,2)
// CCP9CON<CCP9M3>
extern volatile __bit                   CCP9M3              __at(0x781B);	// @ (0xF03 * 8 + 3)
#define                                 CCP9M3_bit          _BIT_ACCESS(CCP9CON,3)
// PMDIS3<CCP9MD>
extern volatile __bit                   CCP9MD              __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 CCP9MD_bit          _BIT_ACCESS(PMDIS3,6)
// ODCON2<CCP9OD>
